#+TITLE: main panel for org mode 
#+DESCRIPTION: this file is to track projects, track is NOT the main purpose. organizing is
#+TODO: READY PROGRESS | COMP
#+TODO: TODO | DONE

* this is the orgnizer for org mode 
here I will list the main framework of my org documents. 
- scratch pad  file:scratch.org

 


* project scratch						    :project:
here are several projects we need to focus on 

** DONE create a website based on github 
   CLOSED: [2016-04-29 Fri 00:19]
   - [X] create the framework 
   - [X] create a test sample 
   - [ ] create the content 
 
** DONE learn using markdown language
   CLOSED: [2016-04-29 Fri 00:19]
   - [X] markdown basic
   - [ ] markdown on emacs 
   - [ ] markdown on org mode
   - [ ] org mode export to github pages 


** DONE move the content to online server [100%]
   CLOSED: [2016-04-29 Fri 00:19]
   - [X] find a online server 

** DONE adding a random picker 
   CLOSED: [2016-05-15 Sun 10:00]
*** DONE supporting tags 
    CLOSED: [2016-05-09 Mon 12:09] DEADLINE: <2016-05-08 Sun> SCHEDULED: <2016-05-03 Tue>
- [X] filter 
- [X] add tag, display tag in events
- [X] random events based on tag 

supporting different tags for each events, random event based on tags
- [ ] progress 1
- [ ] progress 2 

** TODO adding a countdown timmer
- requirement
  - portable component
  - adding event name + dealine. 
  - progress bar 
  - integrate with tagging in the future
** TODO tagging systems for todo 
   


** DONE [#A] org mode/omni focus mail drop			      :emacs:
   CLOSED: [2016-09-30 Fri 17:03] SCHEDULED: <2016-09-18 Sun> DEADLINE: <2016-09-30 Fri>
   - Note taken on [2016-09-17 Sat 15:02] \\
     need to focus on new feature on this script
   CLOCK: [2016-08-25 Thu 22:07]--[2016-08-25 Thu 23:44] =>  1:37
   CLOCK: [2016-08-24 Wed 23:26]--[2016-08-25 Thu 00:47] =>  1:21
- [X] apply on domain 
- [X] sample pop3
- [X] project structure
- [ ] test cases 
- [X] adding org entry with python 
- [X] re-factoring 
- [ ] daemon 

** DONE [#A] org publish to personal web 
   CLOSED: [2016-08-07 Sun 23:32] DEADLINE: <2016-08-07 Sun>
- a script to convert & publish org to md/html
- publish to my personal blog 


** PROGRESS enhance the github personal website
- [X] better publishing tool, to publish article 


** PROGRESS integrate blog with personal site.
   SCHEDULED: <2016-09-09 Fri>
- [X] remove the comment section. make it anonymous only
- [X] create a link to my blog. (easy lol )
- [ ] adding log-in session 
- [X] domain name for the cloud app. 



* online tutorial 
** TODO  coursea


* 读书&写作
** reading							    :reading:
daily reading progress 
*** design pattern [2/4]					       :book:
26 tutorials, 15 min each 
file:designpattern.org 

**** DONE read 1 chapter  
     CLOSED: [2016-05-01 Wed 22:24] SCHEDULED: <2016-04-30 Sat>
**** DONE design pattern read 1 chapetr 
     SCHEDULED: <2016-07-20 Wed>
     - State "DONE"       from "TODO"       [2016-07-15 Fri 18:35]
     - State "DONE"       from "TODO"       [2016-07-15 Fri 18:35]
     - State "DONE"       from "TODO"       [2016-07-07 Thu 19:40]
     - State "DONE"       from "TODO"       [2016-06-28 Tue 19:02]
     - State "DONE"       from "TODO"       [2016-06-22 Wed 19:41]
     - State "DONE"       from "TODO"       [2016-06-16 Thu 17:27]
     - State "DONE"       from "TODO"       [2016-06-08 Wed 18:21]
     - State "DONE"       from "TODO"       [2016-05-17 Tue 04:56]
     - State "DONE"       from "TODO"       [2016-05-10 Tue 18:09]
     - State "DONE"       from "TODO"       [2016-05-06 Fri 17:51]
     :PROPERTIES:
     :LAST_REPEAT: [2016-07-15 Fri 18:35]
     :END:

**** TODO review design pattern					     :review:
     SCHEDULED: <2016-08-26 Fri +1m>
     - State "DONE"       from "TODO"       [2016-07-28 Thu 18:46]
     - State "DONE"       from "TODO"       [2016-07-06 Wed 19:07]
     :PROPERTIES:
     :LAST_REPEAT: [2016-07-28 Thu 18:46]
     :END:


*** javascript design pattern.					       :book:
**** TODO read javascript design pattern. 
     SCHEDULED: <2016-09-05 Mon +4d>
     - State "DONE"       from "TODO"       [2016-08-18 Thu 00:00]
     - State "DONE"       from "TODO"       [2016-08-16 Tue 22:04]
     - State "DONE"       from "TODO"       [2016-08-11 Thu 15:32]
     - State "DONE"       from "TODO"       [2016-08-08 Mon 01:32]
     - State "DONE"       from "TODO"       [2016-08-02 Tue 10:24]
     - State "DONE"       from "TODO"       [2016-07-27 Wed 10:49]
     - State "DONE"       from "TODO"       [2016-07-24 Sun 23:03]
     :PROPERTIES:
     :LAST_REPEAT: [2016-08-18 Thu 00:00]
     :END:

**** DONE review javascript design pattern 
     CLOSED: [2016-08-23 Tue 23:10] DEADLINE: <2016-08-21 Sun>


*** programming pearls [2/3]					       :book:
8 chapters left 
file:programming_pearls.org 
**** DONE read one chapter 
     CLOSED: [2016-04-27 Wed 23:56] SCHEDULED: <2016-04-27 Wed>
**** DONE read one chapter
     CLOSED: [2016-04-28 Thu 23:59]
**** TODO programming pearls read 1 chapter  
     - Note taken on [2016-07-11 Mon 18:11] \\
       this has been delayed for too long.
     - State "DONE"       from "TODO"       [2016-06-30 Thu 10:34]
     - State "DONE"       from "TODO"       [2016-06-02 Thu 13:35]
     - State "DONE"       from "TODO"       [2016-05-09 Mon 12:09]
     :PROPERTIES:
     :LAST_REPEAT: [2016-06-30 Thu 10:34]
     :END:


*** read clean code 						       :book:
**** DONE read clean code 1 chapter 
     CLOSED: [2016-10-04 Tue 16:05]
     - State "DONE"       from "TODO"       [2016-09-26 Mon 17:25]
     CLOCK: [2016-09-26 Mon 16:58]--[2016-09-26 Mon 17:25] =>  0:27
     - State "DONE"       from "TODO"       [2016-09-15 Thu 11:51]
     - State "DONE"       from "TODO"       [2016-09-14 Wed 09:21]
     - State "DONE"       from "TODO"       [2016-09-02 Fri 15:15]
     - State "DONE"       from "TODO"       [2016-08-12 Fri 16:43]
     CLOCK: [2016-08-12 Fri 16:07]--[2016-08-12 Fri 16:35] =>  0:28
     - State "DONE"       from "TODO"       [2016-08-04 Thu 11:18]
     CLOCK: [2016-07-29 Fri 17:28]--[2016-07-29 Fri 18:19] =>  0:51
     - State "DONE"       from "TODO"       [2016-07-22 Fri 16:46]
     - State "DONE"       from "TODO"       [2016-07-19 Tue 10:29]
     - State "DONE"       from "TODO"       [2016-07-11 Mon 11:32]
     - State "DONE"       from "TODO"       [2016-07-08 Fri 16:14]
     - State "DONE"       from "TODO"       [2016-06-30 Thu 18:17]
     - State "DONE"       from "TODO"       [2016-06-28 Tue 17:23]
     - State "DONE"       from "TODO"       [2016-06-23 Thu 18:59]
     :PROPERTIES:
     :LAST_REPEAT: [2016-09-26 Mon 17:25]
     :END:
[[file:cleancode.org]]
**** DONE clean code review
     SCHEDULED: <2016-07-08 Fri>

**** DONE clean code review
     CLOSED: [2016-08-17 Wed 00:35] SCHEDULED: <2016-08-10 Wed>
     CLOCK: [2016-08-16 Tue 23:58]--[2016-08-17 Wed 00:35] =>  0:37
     
**** TODO clean code review 
     SCHEDULED: <2016-10-11 Tue +1w>
     - State "DONE"       from "TODO"       [2016-10-05 Wed 11:16]
     CLOCK: [2016-10-04 Tue 17:37]--[2016-10-05 Wed 11:16] => 17:39
     :PROPERTIES:
     :LAST_REPEAT: [2016-10-05 Wed 11:16]
     :END:
- watch video 
- summarize 


*** TODO read code complete 					       :book:


*** TODO read object oriented thought process			       :book:
    # SCHEDULED: <2016-08-26 Fri .+1w>
    - State "DONE"       from "TODO"       [2016-08-19 Fri 17:57]
    CLOCK: [2016-08-19 Fri 16:58]--[2016-08-19 Fri 17:57] =>  0:59
    - State "DONE"       from "TODO"       [2016-08-08 Mon 01:32]
    - State "DONE"       from "TODO"       [2016-07-29 Fri 15:55]
    CLOCK: [2016-07-29 Fri 15:44]--[2016-07-29 Fri 15:55] =>  0:11
    CLOCK: [2016-07-29 Fri 15:00]--[2016-07-29 Fri 15:14] =>  0:14
    - State "DONE"       from "TODO"       [2016-07-25 Mon 17:49]
    CLOCK: [2016-07-25 Mon 16:52]--[2016-07-25 Mon 17:48] =>  0:56
    - State "DONE"       from "TODO"       [2016-07-22 Fri 00:03]
    :PROPERTIES:
    :LAST_REPEAT: [2016-08-19 Fri 17:57]
    :END:

    





* writing 							    :writing:
** DONE writing my first blog					    

** DONE [#A] writing practice.
   CLOSED: [2016-08-16 Tue 00:28] DEADLINE: <2016-08-15 Mon>
- weekly writing.
- each article should have a topic  
- refer to [[http://www.yinwang.org/]]
- topic:
  - 说明文。 
  - how to start programming. 




** TODO [#A] reflection, writing journal
   SCHEDULED: <2016-10-01 Sat .+3d/5d>
   - State "DONE"       from "TODO"       [2016-09-28 Wed 00:26]
   CLOCK: [2016-09-27 Tue 23:57]--[2016-09-28 Wed 00:26] =>  0:29
   - State "DONE"       from "PROGRESS"   [2016-09-27 Tue 17:35]
   - State "DONE"       from "TODO"       [2016-09-15 Thu 01:05]
   CLOCK: [2016-09-15 Thu 00:57]--[2016-09-15 Thu 01:05] =>  0:08
   - State "DONE"       from "TODO"       [2016-09-13 Tue 00:01]
   - State "DONE"       from "TODO"       [2016-09-13 Tue 00:01]
   CLOCK: [2016-09-12 Mon 22:28]--[2016-09-13 Tue 00:01] =>  1:33
   - State "DONE"       from "TODO"       [2016-09-07 Wed 00:01]
   - State "DONE"       from "TODO"       [2016-09-03 Sat 22:39]
   - State "DONE"       from "TODO"       [2016-09-02 Fri 12:03]
   - State "DONE"       from "TODO"       [2016-09-02 Fri 12:03]
   - State "DONE"       from "TODO"       [2016-08-23 Tue 23:46]
   CLOCK: [2016-08-23 Tue 23:35]--[2016-08-23 Tue 23:46] =>  0:11
   - State "DONE"       from "TODO"       [2016-08-22 Mon 21:04]
   CLOCK: [2016-08-22 Mon 20:53]--[2016-08-22 Mon 21:04] =>  0:11
   - State "DONE"       from "TODO"       [2016-08-21 Sun 22:36]
   CLOCK: [2016-08-21 Sun 22:24]--[2016-08-21 Sun 22:36] =>  0:12
   - State "DONE"       from "TODO"       [2016-08-16 Tue 23:30]
   CLOCK: [2016-08-16 Tue 23:05]--[2016-08-16 Tue 23:30] =>  0:25
   :PROPERTIES:
   :LAST_REPEAT: [2016-09-28 Wed 00:26]
   :STYLE:    habit
   :END:
- reading past journals
- writing journals 


* misc 
** TODO build a home theater 

** TODO build the a server 
   - [ ] do research online 




   
** DONE ergo work space
   

* leetcode							   :leetcode:
file:leetcode.org
** easy problems	[50%]					  :interview:
   CLOSED: [2016-05-19 Thu 09:41]
- 50 problems in total 
- do review each week. 
trainning focus:
- no compiling error
*** DONE leetcode 3 problems 
    SCHEDULED: <2016-05-13 Fri>
    - State "DONE"       from "TODO"       [2016-06-15 Wed 19:23]
    - State "DONE"       from "TODO"       [2016-05-09 Mon 20:02]
    - State "DONE"       from "TODO"       [2016-05-05 Thu 19:49]
    :PROPERTIES:
    :LAST_REPEAT: [2016-06-15 Wed 19:23]
    :END:

*** TODO leetcode easy problem review				     :review:
    DEADLINE: <2016-09-11 Sun .+1w>
    - State "DONE"       from "TODO"       [2016-07-27 Wed 10:59]
    :PROPERTIES:
    :LAST_REPEAT: [2016-07-27 Wed 10:59]
    :END:

** medium 
- most important problems 
- 132 in total. 
- appro 80 days. 
*** TODO [#B] leetcode 2 problems medium
    SCHEDULED: <2016-09-18 Sun .+4d>
    - State "DONE"       from "TODO"       [2016-09-14 Wed 17:58]
    CLOCK: [2016-09-14 Wed 17:35]--[2016-09-14 Wed 17:58] =>  0:23
    - State "DONE"       from "TODO"       [2016-08-22 Mon 21:36]
    - State "DONE"       from "TODO"       [2016-08-10 Wed 22:19]
    - State "DONE"       from "TODO"       [2016-08-08 Mon 01:33]
    - State "DONE"       from "TODO"       [2016-08-03 Wed 17:18]
    - State "DONE"       from "TODO"       [2016-07-22 Fri 11:17]
    - State "DONE"       from "TODO"       [2016-06-14 Tue 19:01]
    :PROPERTIES:
    :LAST_REPEAT: [2016-09-14 Wed 17:58]
    :END:

** TODO leetcode hard problems 
 


* finance
** investment							  :investing:
[[file:invest.org]]
*** DONE [#B] learn stock basic
    CLOSED: [2016-08-21 Sun 23:21] DEADLINE: <2016-07-30 Sat>
    CLOCK: [2016-08-21 Sun 22:47]--[2016-08-21 Sun 23:21] =>  0:34

*** TODO read neatest guide to stock			       :reading:book:
    SCHEDULED: <2016-10-11 Tue +1w>
    - State "DONE"       from "PROGRESS"   [2016-10-04 Tue 12:29]
    - State "DONE"       from "TODO"       [2016-09-27 Tue 23:57]
    - State "DONE"       from "TODO"       [2016-09-19 Mon 15:24]
    - State "DONE"       from "TODO"       [2016-09-19 Mon 15:22]
    - State "DONE"       from "TODO"       [2016-09-12 Mon 22:26]
    :PROPERTIES:
    :LAST_REPEAT: [2016-10-04 Tue 12:29]
    :END:
:LAST_REPEAT: [2016-09-19 Mon 15:24]


*** TODO IB basics 
    DEADLINE: <2016-09-11 Sun>



    


*** TODO do research on your own investing history 
- gain & lose 
- bucket of stocks 


